of40/tutorials/rheoEFoam/channelEDF/PowerLaw/PoissonBoltzmann/constant/electricProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      electricProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
parameters
{
        type             PoissonBoltzmann;      
  
        relPerm          relPerm [ 0 0 0 0 0 0 0 ] 80.1;  
        T                T [ 0 0 0 1 0 0 0 ] 298;
        psiContrib       false;
        extraEField      extraEField [ 1 1 -3 0 0 -1  0 ] (5000 0 0);
        
        species
        (        
           cations
           {        
              z                 z [ 0 0 0 0 0 0 0 ] 1;      
              c0                c0 [ 0 -3 0 0 1 0 0 ] 9.43798e-05;          
           }
           
           anions
           {  
              z                 z [ 0 0 0 0 0 0 0 ] -1;         
              c0                c0 [ 0 -3 0 0 1 0 0 ] 9.43798e-05;        
           }               
        ); 
}

// ************************************************************************* //
